AI_Debug/InformationRegisters/AI_AnonymizationPolicy.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>AI_AnonymizationPolicy</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Включено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДанных</Name>
					<Comment>ФИО | ИНН | Телефон | Email | ПроизвольноеИмя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Режим</Name>
					<Comment>Токен | Маскировать</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AI_Debug/InformationRegisters/AI_AnonymizationMap.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>AI_AnonymizationMap</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РеальноеЗначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Категория</Name>
					<Comment>Вид данных: ЛИЦО | ИНН | ТЕЛЕФОН | EMAIL</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AI_Debug/CommonModules/AI_Anonymizer/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Модуль AI_Anonymizer: необратимая маскировка секретов на стороне сервера
// (граница ROCTUP по мотивам SteelMorgan/1c-mcp-tools).
//
// Принцип: значение уходит наружу уже заменённым на маркер [SECRET_REMOVED];
// исходное значение в ответ не попадает ни в каком виде.
//
// Покрытие: колонки результата execute_query и значения ключей
// структур/соответствий/массивов в результате execute_code.
// Сопоставление — по имени колонки/ключа (см. МаркерыСекретныхИмен);
// значения-строки без секретного имени не анализируются.
//

#Область ПрограммныйИнтерфейс

// Маркер замены секретного значения
//
Функция МаркерСекрета() Экспорт
	Возврат "[SECRET_REMOVED]";
КонецФункции

// Проверяет имя колонки, реквизита или ключа на признак секрета
// (пароль, токен, ключ API, приватный ключ).
//
// Параметры:
//   Имя - Строка - имя колонки запроса, реквизита или ключа структуры
//
// Возвращаемое значение:
//   Булево
//
Функция ЭтоСекретноеИмя(Имя) Экспорт

	Если НЕ ЗначениеЗаполнено(Имя) Тогда
		Возврат Ложь;
	КонецЕсли;

	ИмяНРег = НРег(Имя);
	Для Каждого Маркер Из МаркерыСекретныхИмен() Цикл
		Если СтрНайти(ИмяНРег, Маркер) > 0 Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;

	Возврат Ложь;

КонецФункции

// Возвращает копию значения с замаскированными секретами.
// Структура, Соответствие, Массив — рекурсивно (до 5 уровней);
// прочие типы возвращаются без изменений.
//
// Параметры:
//   Значение - Произвольный - исходное значение
//   Глубина - Число - служебный, текущий уровень рекурсии
//
// Возвращаемое значение:
//   Произвольный - копия с маскировкой или исходное значение
//
Функция МаскироватьСекреты(Значение, Глубина = 0) Экспорт

	Если Глубина > 5 Тогда
		Возврат Значение;
	КонецЕсли;

	ТипЗначения = ТипЗнч(Значение);

	Если ТипЗначения = Тип("Структура") Тогда

		Копия = Новый Структура;
		Для Каждого КлючЗначение Из Значение Цикл
			Если ЭтоСекретноеИмя(КлючЗначение.Ключ)
				И ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
				Копия.Вставить(КлючЗначение.Ключ, МаркерСекрета());
			Иначе
				Копия.Вставить(КлючЗначение.Ключ,
					МаскироватьСекреты(КлючЗначение.Значение, Глубина + 1));
			КонецЕсли;
		КонецЦикла;
		Возврат Копия;

	ИначеЕсли ТипЗначения = Тип("Соответствие") Тогда

		Копия = Новый Соответствие;
		Для Каждого КлючЗначение Из Значение Цикл
			Если ТипЗнч(КлючЗначение.Ключ) = Тип("Строка")
				И ЭтоСекретноеИмя(КлючЗначение.Ключ)
				И ЗначениеЗаполнено(КлючЗначение.Значение) Тогда
				Копия.Вставить(КлючЗначение.Ключ, МаркерСекрета());
			Иначе
				Копия.Вставить(КлючЗначение.Ключ,
					МаскироватьСекреты(КлючЗначение.Значение, Глубина + 1));
			КонецЕсли;
		КонецЦикла;
		Возврат Копия;

	ИначеЕсли ТипЗначения = Тип("Массив") Тогда

		Копия = Новый Массив;
		Для Каждого Элемент Из Значение Цикл
			Копия.Добавить(МаскироватьСекреты(Элемент, Глубина + 1));
		КонецЦикла;
		Возврат Копия;

	КонецЕсли;

	Возврат Значение;

КонецФункции

// Проверяет, включена ли реверсивная анонимизация ПДн.
// Мастер-запись политики: ОбъектМетаданных = "__GLOBAL__", Реквизит = "__MASTER__".
// Записи нет или Включено = Ложь — анонимизация не применяется (поведение как раньше).
//
// Возвращаемое значение:
//   Булево
//
Функция ПолитикаАнонимизацииАктивна() Экспорт

	Запрос = Новый Запрос(
		"ВЫБРАТЬ Включено ИЗ РегистрСведений.AI_AnonymizationPolicy
		|ГДЕ ОбъектМетаданных = &Объект И Реквизит = &Реквизит");
	Запрос.УстановитьПараметр("Объект", ИмяМастерЗаписиОбъект());
	Запрос.УстановитьПараметр("Реквизит", ИмяМастерЗаписиРеквизит());

	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий() И Выборка.Включено = Истина;

КонецФункции

// Анонимизирует текст, только если политика включена (см. ПолитикаАнонимизацииАктивна).
// Точка интеграции для вызывающих модулей: execute_query / execute_code.
//
// Параметры:
//   Текст   - Строка - исходный текст
//   Область - Строка - область токенов (query, code, ...), по умолчанию "default"
//   ИмяПоля - Строка - имя колонки/поля, если известно (для классификации ФИО и правил)
//
// Возвращаемое значение:
//   Строка - текст с токенами вместо ПДн или исходный текст
//
Функция АнонимизироватьПоПолитике(Текст, Область = "default", ИмяПоля = "") Экспорт

	Если НЕ ПолитикаАнонимизацииАктивна() Тогда
		Возврат Текст;
	КонецЕсли;

	Возврат АнонимизироватьТекст(Текст, Область, ИмяПоля);

КонецФункции

// Реверсивная анонимизация ПДн в строке. Сам механизм — без проверки политики
// (проверка — в АнонимизироватьПоПолитике и в точках интеграции).
//
// Что ловит:
// - по имени поля (ИмяПоля): ФИО/ИНН/Телефон/Email — значение поля заменяется целиком;
//   правила из РС AI_AnonymizationPolicy переопределяют вид данных и режим
//   (Токен — реверсивно через РС AI_AnonymizationMap, Маскировать — необратимо [СКРЫТО]);
// - в свободном тексте: ИИН/ИНН/БИН/РНН (10-12 цифр после слова-контекста),
//   телефоны (+7/8 с 10 цифрами), email.
//
// Токены стабильны: пара (Область, Категория, Значение) ищется в карте,
// при отсутствии создаётся новая запись со следующим номером.
//
// Параметры:
//   Текст   - Строка - исходный текст
//   Область - Строка - область токенов, по умолчанию "default"
//   ИмяПоля - Строка - имя колонки/поля, если известно
//
// Возвращаемое значение:
//   Строка - текст с токенами вида [ЛИЦО_1], [ИНН_2], [ТЕЛЕФОН_1], [EMAIL_1]
//
Функция АнонимизироватьТекст(Текст, Область = "default", ИмяПоля = "") Экспорт

	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Возврат Текст;
	КонецЕсли;

	// 1. Поле, классифицированное как ПДн: значение заменяется целиком.
	Если ЗначениеЗаполнено(ИмяПоля) Тогда

		ВидДанных = "";
		Режим = "";

		Правило = НайтиПравилоПолитики(ИмяПоля);
		Если Правило <> Неопределено Тогда
			ВидДанных = Правило.ВидДанных;
			Режим = Правило.Режим;
		КонецЕсли;

		Если ПустаяСтрока(ВидДанных) Тогда
			ВидДанных = КлассифицироватьИмяПоля(ИмяПоля);
		КонецЕсли;

		Если НЕ ПустаяСтрока(ВидДанных) Тогда
			ЗначениеПоля = СокрЛП(Текст);
			// Длинные текстовые значения (описания, комментарии) целиком не токенизируем —
			// они обрабатываются контекстными детекторами ниже.
			Если ЗначениеЗаполнено(ЗначениеПоля) И СтрДлина(ЗначениеПоля) <= 150 Тогда
				Возврат ЗаменаДляЗначения(Область, ВидДанных, ЗначениеПоля, Режим);
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;

	// 2. Контекстные детекторы в свободном тексте.
	Результат = ЗаменитьИННсКонтекстом(Текст, Область);
	Результат = ЗаменитьТелефоны(Результат, Область);
	Результат = ЗаменитьEmail(Результат, Область);

	Возврат Результат;

КонецФункции

// Обратная замена токенов на реальные значения по карте области.
// Токены, которых нет в карте, остаются как есть.
//
// Параметры:
//   Текст   - Строка - текст с токенами
//   Область - Строка - область токенов, по умолчанию "default"
//
// Возвращаемое значение:
//   Строка - текст с восстановленными значениями
//
Функция ДеанонимизироватьТекст(Текст, Область = "default") Экспорт

	Если НЕ ЗначениеЗаполнено(Текст) Тогда
		Возврат Текст;
	КонецЕсли;

	Результат = Текст;

	Запрос = Новый Запрос(
		"ВЫБРАТЬ Токен, РеальноеЗначение
		|ИЗ РегистрСведений.AI_AnonymizationMap
		|ГДЕ Канал = &Канал");
	Запрос.УстановитьПараметр("Канал", Область);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Токен) Тогда
			Результат = СтрЗаменить(Результат, Выборка.Токен, Выборка.РеальноеЗначение);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Описания инструментов модуля для MCP tools/list.
//
Функция ОписаниеИнструментов() Экспорт

	Инструменты = Новый Массив;

	// get_anonymization_map
	ИнстрКарта = Новый Структура;
	ИнстрКарта.Вставить("name", "get_anonymization_map");
	ИнстрКарта.Вставить("description",
		"Возвращает карту анонимизации ПДн (токен → реальное значение) по области. "
		+ "Воркер забирает карту и деанонимизирует финальный ответ LLM локально. Только чтение.");
	СхемаКарта = Новый Структура;
	СхемаКарта.Вставить("type", "object");
	СвойстваКарта = Новый Структура;
	СвойстваКарта.Вставить("scope", Новый Структура("type,description", "string",
		"Область анонимизации (query, code, default). Пусто или ""*"" — все области"));
	СхемаКарта.Вставить("properties", СвойстваКарта);
	СхемаКарта.Вставить("required", Новый Массив);
	ИнстрКарта.Вставить("inputSchema", СхемаКарта);
	Инструменты.Добавить(ИнстрКарта);

	// set_anonymization_policy
	ИнстрПолитика = Новый Структура;
	ИнстрПолитика.Вставить("name", "set_anonymization_policy");
	ИнстрПолитика.Вставить("description",
		"Управление политикой анонимизации ПДн. action=enable|disable — мастер-выключатель; "
		+ "action=add — добавить правило (fieldPattern — имя поля/паттерн, dataKind — ФИО|ИНН|Телефон|Email|ПроизвольноеИмя, "
		+ "mode — Токен|Маскировать, metadataObject — объект метаданных или ""*""); "
		+ "action=remove — удалить правило; action=list — текущая политика.");
	СхемаПолитика = Новый Структура;
	СхемаПолитика.Вставить("type", "object");
	СвойстваПолитика = Новый Структура;
	СвойстваПолитика.Вставить("action", Новый Структура("type,description", "string",
		"enable | disable | add | remove | list"));
	СвойстваПолитика.Вставить("dataKind", Новый Структура("type,description", "string",
		"Вид данных: ФИО | ИНН | Телефон | Email | ПроизвольноеИмя (для add)"));
	СвойстваПолитика.Вставить("fieldPattern", Новый Структура("type,description", "string",
		"Имя поля или паттерн (для add/remove; ""*"" — любое поле)"));
	СвойстваПолитика.Вставить("mode", Новый Структура("type,description", "string",
		"Режим: Токен (реверсивно) | Маскировать (необратимо). По умолчанию Токен"));
	СвойстваПолитика.Вставить("metadataObject", Новый Структура("type,description", "string",
		"Объект метаданных, к которому относится правило. По умолчанию ""*"""));
	СхемаПолитика.Вставить("properties", СвойстваПолитика);
	СхемаПолитика.Вставить("required", AI_Utils.ПолучитьМассив("action"));
	ИнстрПолитика.Вставить("inputSchema", СхемаПолитика);
	Инструменты.Добавить(ИнстрПолитика);

	Возврат Инструменты;

КонецФункции

// Выполняет инструмент модуля. Логирование вызовов — централизованно
// в AI_Core.ВыполнитьИнструмент (AI_Logger.ЗаписатьУспех/ЗаписатьОшибку).
//
Функция ВыполнитьИнструмент(ИмяИнструмента, Параметры) Экспорт

	Если ИмяИнструмента = "get_anonymization_map" Тогда
		Возврат ВыгрузитьКартуАнонимизации(Параметры);
	ИначеЕсли ИмяИнструмента = "set_anonymization_policy" Тогда
		Возврат УправлениеПолитикой(Параметры);
	КонецЕсли;

	Ответ = Новый Структура;
	Ответ.Вставить("success", Ложь);
	Ответ.Вставить("error", "Не реализован инструмент: " + ИмяИнструмента);
	Возврат Ответ;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Форматирует значение реквизита для вывода наружу: секретное имя
// с заполненным значением — маркер, остальное — как есть.
//
Функция ФорматироватьДляВывода(Имя, Значение) Экспорт

	Если ЭтоСекретноеИмя(Имя) И ЗначениеЗаполнено(Значение) Тогда
		Возврат МаркерСекрета();
	КонецЕсли;

	Возврат AI_Utils.ФорматироватьЗначение(Значение);

КонецФункции

// Подстроки (НРег), по которым имя признаётся секретным.
// «Ключ» без уточнителя не входит: слишком много ложных срабатываний
// (КлючЗаписи, КлючСвязи, КлючСтроки).
//
Функция МаркерыСекретныхИмен()

	Маркеры = Новый Массив;
	Маркеры.Добавить("парол");
	Маркеры.Добавить("password");
	Маркеры.Добавить("passwd");
	Маркеры.Добавить("токен");
	Маркеры.Добавить("token");
	Маркеры.Добавить("secret");
	Маркеры.Добавить("секрет");
	Маркеры.Добавить("apikey");
	Маркеры.Добавить("api_key");
	Маркеры.Добавить("api-ключ");
	Маркеры.Добавить("ключapi");
	Маркеры.Добавить("приватныйключ");
	Маркеры.Добавить("privatekey");
	Маркеры.Добавить("private_key");
	Маркеры.Добавить("authorization");

	Возврат Маркеры;

КонецФункции

#КонецОбласти

#Область АнонимизацияПДн

// --- Карта токенов (РС AI_AnonymizationMap) ---

// Возвращает стабильный токен для значения: ищет в карте, при отсутствии
// создаёт запись со следующим номером категории в области.
//
Функция ТокенДляЗначения(Область, Категория, Значение)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1 Токен ИЗ РегистрСведений.AI_AnonymizationMap
		|ГДЕ Канал = &Канал И Категория = &Категория И РеальноеЗначение = &Значение");
	Запрос.УстановитьПараметр("Канал", Область);
	Запрос.УстановитьПараметр("Категория", Категория);
	Запрос.УстановитьПараметр("Значение", Значение);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Токен;
	КонецЕсли;

	// Новый токен: следующий свободный номер категории в области.
	ЗапросНомера = Новый Запрос(
		"ВЫБРАТЬ Токен ИЗ РегистрСведений.AI_AnonymizationMap
		|ГДЕ Канал = &Канал И Категория = &Категория");
	ЗапросНомера.УстановитьПараметр("Канал", Область);
	ЗапросНомера.УстановитьПараметр("Категория", Категория);
	ЗанятыеТокены = ЗапросНомера.Выполнить().Выгрузить();
	ЗанятыеТокены.Индексы.Добавить("Токен");

	Номер = ЗанятыеТокены.Количество() + 1;
	Токен = "[" + Категория + "_" + Формат(Номер, "ЧГ=") + "]";
	Пока ЗанятыеТокены.Найти(Токен, "Токен") <> Неопределено Цикл
		Номер = Номер + 1;
		Токен = "[" + Категория + "_" + Формат(Номер, "ЧГ=") + "]";
	КонецЦикла;

	Менеджер = РегистрыСведений.AI_AnonymizationMap.СоздатьМенеджерЗаписи();
	Менеджер.Канал = Область;
	Менеджер.Токен = Токен;
	Менеджер.РеальноеЗначение = Значение;
	Менеджер.Категория = Категория;
	Менеджер.ДатаСоздания = ТекущаяДатаСеанса();
	Менеджер.Записать();

	Возврат Токен;

КонецФункции

// Замена для целого значения поля по виду данных и режиму правила.
//
Функция ЗаменаДляЗначения(Область, ВидДанных, Значение, Режим)

	Если НРег(СокрЛП(Режим)) = "маскировать" Тогда
		Возврат "[СКРЫТО]";
	КонецЕсли;

	Категория = КатегорияПоВидуДанных(ВидДанных);
	Если ПустаяСтрока(Категория) Тогда
		Возврат Значение;
	КонецЕсли;

	Возврат ТокенДляЗначения(Область, Категория, Значение);

КонецФункции

// Категория токена по виду данных политики.
//
Функция КатегорияПоВидуДанных(ВидДанных)

	ВидНРег = НРег(СокрЛП(ВидДанных));
	Если ВидНРег = "фио" ИЛИ ВидНРег = "лицо" Тогда
		Возврат "ЛИЦО";
	ИначеЕсли ВидНРег = "инн" ИЛИ ВидНРег = "иин" ИЛИ ВидНРег = "бин" ИЛИ ВидНРег = "рнн" Тогда
		Возврат "ИНН";
	ИначеЕсли ВидНРег = "телефон" ИЛИ ВидНРег = "phone" Тогда
		Возврат "ТЕЛЕФОН";
	ИначеЕсли ВидНРег = "email" ИЛИ ВидНРег = "e-mail" ИЛИ ВидНРег = "почта" Тогда
		Возврат "EMAIL";
	ИначеЕсли ВидНРег = "произвольноеимя" Тогда
		Возврат "ИМЯ";
	КонецЕсли;

	Возврат "";

КонецФункции

// Классификация имени поля по умолчанию (без правил политики).
//
Функция КлассифицироватьИмяПоля(ИмяПоля)

	ИмяНРег = НРег(ИмяПоля);

	Если СтрНайти(ИмяНРег, "иин") > 0 ИЛИ СтрНайти(ИмяНРег, "инн") > 0
		ИЛИ СтрНайти(ИмяНРег, "бин") > 0 ИЛИ СтрНайти(ИмяНРег, "рнн") > 0 Тогда
		Возврат "ИНН";
	КонецЕсли;

	Если СтрНайти(ИмяНРег, "телефон") > 0 ИЛИ СтрНайти(ИмяНРег, "phone") > 0 Тогда
		Возврат "Телефон";
	КонецЕсли;

	Если СтрНайти(ИмяНРег, "email") > 0 ИЛИ СтрНайти(ИмяНРег, "e-mail") > 0
		ИЛИ СтрНайти(ИмяНРег, "почта") > 0 Тогда
		Возврат "Email";
	КонецЕсли;

	Если СтрНайти(ИмяНРег, "фио") > 0 ИЛИ СтрНайти(ИмяНРег, "фамилия") > 0
		ИЛИ СтрНайти(ИмяНРег, "сотрудник") > 0 ИЛИ СтрНайти(ИмяНРег, "контрагент") > 0
		ИЛИ СтрНайти(ИмяНРег, "наименование") > 0 Тогда
		Возврат "ФИО";
	КонецЕсли;

	Возврат "";

КонецФункции

// Ищет включённое правило политики для поля: подстрока Реквизит в имени поля
// (НРег, без учёта регистра) или Реквизит = "*".
//
Функция НайтиПравилоПолитики(ИмяПоля)

	Запрос = Новый Запрос(
		"ВЫБРАТЬ Реквизит, ВидДанных, Режим
		|ИЗ РегистрСведений.AI_AnonymizationPolicy
		|ГДЕ Включено И ОбъектМетаданных <> &МастерОбъект");

	Запрос.УстановитьПараметр("МастерОбъект", ИмяМастерЗаписиОбъект());

	ИмяНРег = НРег(ИмяПоля);

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Паттерн = СокрЛП(Выборка.Реквизит);
		Если Паттерн = "*" ИЛИ (НЕ ПустаяСтрока(Паттерн)
			И СтрНайти(ИмяНРег, НРег(Паттерн)) > 0) Тогда
			Правило = Новый Структура;
			Правило.Вставить("ВидДанных", СокрЛП(Выборка.ВидДанных));
			Правило.Вставить("Режим", СокрЛП(Выборка.Режим));
			Возврат Правило;
		КонецЕсли;
	КонецЦикла;

	Возврат Неопределено;

КонецФункции

Функция ИмяМастерЗаписиОбъект()
	Возврат "__GLOBAL__";
КонецФункции

Функция ИмяМастерЗаписиРеквизит()
	Возврат "__MASTER__";
КонецФункции

// --- Детекторы в свободном тексте (без RegExp — посимвольный разбор) ---

// ИИН/ИНН/БИН/РНН: 10 или 12 цифр после слова-контекста.
//
Функция ЗаменитьИННсКонтекстом(Текст, Область)

	Маркеры = Новый Массив;
	Маркеры.Добавить("иин");
	Маркеры.Добавить("инн");
	Маркеры.Добавить("бин");
	Маркеры.Добавить("рнн");

	ТекстНРег = НРег(Текст);
	ДлинаТекста = СтрДлина(Текст);

	// Собираем замены (позиция, длина, значение), применяем справа налево —
	// позиции левее уже заменённого не сдвигаются.
	Замены = Новый Массив;

	Для Каждого Маркер Из Маркеры Цикл

		ПозицияМаркера = СтрНайти(ТекстНРег, Маркер);
		Пока ПозицияМаркера > 0 Цикл

			ГраницаСлева = Истина;
			Если ПозицияМаркера > 1 Тогда
				ПредСимвол = Сред(ТекстНРег, ПозицияМаркера - 1, 1);
				Если ЭтоБуква(ПредСимвол) ИЛИ ЭтоЦифра(ПредСимвол) Тогда
					ГраницаСлева = Ложь;
				КонецЕсли;
			КонецЕсли;

			Если ГраницаСлева Тогда

				П = ПозицияМаркера + СтрДлина(Маркер);
				Пока П <= ДлинаТекста Цикл
					С = Сред(Текст, П, 1);
					Если С = " " ИЛИ С = ":" ИЛИ С = "№" ИЛИ С = "-" ИЛИ С = Символы.Таб Тогда
						П = П + 1;
					Иначе
						Прервать;
					КонецЕсли;
				КонецЦикла;

				НачалоЦифр = П;
				Пока П <= ДлинаТекста И ЭтоЦифра(Сред(Текст, П, 1)) Цикл
					П = П + 1;
				КонецЦикла;

				КоличествоЦифр = П - НачалоЦифр;
				Если КоличествоЦифр = 10 ИЛИ КоличествоЦифр = 12 Тогда
					Замены.Добавить(Новый Структура("Позиция,Длина,Значение",
						НачалоЦифр, КоличествоЦифр, Сред(Текст, НачалоЦифр, КоличествоЦифр)));
				КонецЕсли;

			КонецЕсли;

			ПозицияМаркера = СтрНайти(ТекстНРег, Маркер, , ПозицияМаркера + 1);

		КонецЦикла;

	КонецЦикла;

	Возврат ПрименитьЗаменыСправаНалево(Текст, Замены, Область, "ИНН");

КонецФункции

// Телефоны: +7 или 8 на границе слова + ровно 10 цифр с разделителями " ()-".
//
Функция ЗаменитьТелефоны(Текст, Область)

	ДлинаТекста = СтрДлина(Текст);
	Результат = "";
	Поз = 1;

	Пока Поз <= ДлинаТекста Цикл

		Симв = Сред(Текст, Поз, 1);

		ЭтоНачалоНомера = Ложь;
		ДлинаПрефикса = 0;

		Если Симв = "+" И Поз < ДлинаТекста И Сред(Текст, Поз + 1, 1) = "7" Тогда
			ПредСимвол = ?(Поз > 1, Сред(Текст, Поз - 1, 1), "");
			Если НЕ ЭтоЦифра(ПредСимвол) И НЕ ЭтоБуква(ПредСимвол) Тогда
				ЭтоНачалоНомера = Истина;
				ДлинаПрефикса = 2;
			КонецЕсли;
		ИначеЕсли Симв = "8" Тогда
			ПредСимвол = ?(Поз > 1, Сред(Текст, Поз - 1, 1), "");
			Если НЕ ЭтоЦифра(ПредСимвол) И НЕ ЭтоБуква(ПредСимвол) Тогда
				ЭтоНачалоНомера = Истина;
				ДлинаПрефикса = 1;
			КонецЕсли;
		КонецЕсли;

		Если НЕ ЭтоНачалоНомера Тогда
			Результат = Результат + Симв;
			Поз = Поз + 1;
			Продолжить;
		КонецЕсли;

		// Разбор номера: префикс + 10 цифр с разделителями.
		НомерТекст = Сред(Текст, Поз, ДлинаПрефикса);
		П = Поз + ДлинаПрефикса;
		Цифр = 0;
		КонецНомера = Поз + ДлинаПрефикса - 1;

		Пока П <= ДлинаТекста Цикл
			С = Сред(Текст, П, 1);
			Если ЭтоЦифра(С) Тогда
				Цифр = Цифр + 1;
				Если Цифр > 10 Тогда
					Прервать;
				КонецЕсли;
				НомерТекст = НомерТекст + С;
				КонецНомера = П;
			ИначеЕсли (С = " " ИЛИ С = "(" ИЛИ С = ")" ИЛИ С = "-") И Цифр < 10 Тогда
				НомерТекст = НомерТекст + С;
			Иначе
				Прервать;
			КонецЕсли;
			П = П + 1;
		КонецЦикла;

		Если Цифр = 10 Тогда
			Токен = ТокенДляЗначения(Область, "ТЕЛЕФОН", НомерТекст);
			Результат = Результат + Токен;
			Поз = КонецНомера + 1;
			Продолжить;
		КонецЕсли;

		// Не номер — переносим первый символ и идём дальше.
		Результат = Результат + Симв;
		Поз = Поз + 1;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Email: локальная часть + @ + домен с точкой и суффиксом от 2 символов.
//
Функция ЗаменитьEmail(Текст, Область)

	Результат = Текст;

	ПозицияСобаки = СтрНайти(Результат, "@");
	Пока ПозицияСобаки > 0 Цикл

		НачалоАдреса = ПозицияСобаки;
		Пока НачалоАдреса > 1 Цикл
			С = Сред(Результат, НачалоАдреса - 1, 1);
			Если ЭтоБуква(С) ИЛИ ЭтоЦифра(С) ИЛИ СтрНайти("._%+-", С) > 0 Тогда
				НачалоАдреса = НачалоАдреса - 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;

		КонецАдреса = ПозицияСобаки;
		ДлинаТекста = СтрДлина(Результат);
		Пока КонецАдреса < ДлинаТекста Цикл
			С = Сред(Результат, КонецАдреса + 1, 1);
			Если ЭтоБуква(С) ИЛИ ЭтоЦифра(С) ИЛИ С = "." ИЛИ С = "-" Тогда
				КонецАдреса = КонецАдреса + 1;
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Адрес = Сред(Результат, НачалоАдреса, КонецАдреса - НачалоАдреса + 1);
		Домен = Сред(Адрес, СтрНайти(Адрес, "@") + 1);
		ПозицияТочки = СтрНайти(Домен, ".", НаправлениеПоиска.СКонца);

		Если СтрДлина(Адрес) >= 6 И ПозицияТочки > 1
			И СтрДлина(Домен) - ПозицияТочки >= 2 Тогда
			Токен = ТокенДляЗначения(Область, "EMAIL", Адрес);
			Результат = Лев(Результат, НачалоАдреса - 1) + Токен + Сред(Результат, КонецАдреса + 1);
			ПозицияСобаки = СтрНайти(Результат, "@", , НачалоАдреса + СтрДлина(Токен));
		Иначе
			ПозицияСобаки = СтрНайти(Результат, "@", , ПозицияСобаки + 1);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

// Применяет собранные замены справа налево.
//
Функция ПрименитьЗаменыСправаНалево(Текст, Замены, Область, Категория)

	Если Замены.Количество() = 0 Тогда
		Возврат Текст;
	КонецЕсли;

	// Сортировка по позиции по убыванию (пузырьком — замен мало).
	Для И = 0 По Замены.Количество() - 2 Цикл
		Для Ж = 0 По Замены.Количество() - 2 - И Цикл
			Если Замены[Ж].Позиция < Замены[Ж + 1].Позиция Тогда
				Врем = Замены[Ж];
				Замены[Ж] = Замены[Ж + 1];
				Замены[Ж + 1] = Врем;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Результат = Текст;
	Для Каждого Замена Из Замены Цикл
		// Защита от пересечений: участок должен совпадать с исходным значением.
		Если Сред(Результат, Замена.Позиция, Замена.Длина) <> Замена.Значение Тогда
			Продолжить;
		КонецЕсли;
		Токен = ТокенДляЗначения(Область, Категория, Замена.Значение);
		Результат = Лев(Результат, Замена.Позиция - 1) + Токен
			+ Сред(Результат, Замена.Позиция + Замена.Длина);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ЭтоЦифра(Символ)
	Возврат НЕ ПустаяСтрока(Символ) И СтрНайти("0123456789", Символ) > 0;
КонецФункции

Функция ЭтоБуква(Символ)
	Если ПустаяСтрока(Символ) Тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат СтрНайти("abcdefghijklmnopqrstuvwxyzабвгдеёжзийклмнопрстуфхцчшщъыьэюя", НРег(Символ)) > 0;
КонецФункции

// --- Инструменты get_anonymization_map / set_anonymization_policy ---

Функция ВыгрузитьКартуАнонимизации(Параметры)

	Область = "";
	Если Параметры.Свойство("scope") Тогда
		Область = СокрЛП(Параметры.scope);
	КонецЕсли;

	ТекстЗапроса =
		"ВЫБРАТЬ Канал, Токен, РеальноеЗначение, Категория, ДатаСоздания
		|ИЗ РегистрСведений.AI_AnonymizationMap";
	Если Область <> "" И Область <> "*" Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|ГДЕ Канал = &Канал";
	КонецЕсли;
	ТекстЗапроса = ТекстЗапроса + "
		|УПОРЯДОЧИТЬ ПО Канал, Категория, Токен";

	Запрос = Новый Запрос(ТекстЗапроса);
	Если Область <> "" И Область <> "*" Тогда
		Запрос.УстановитьПараметр("Канал", Область);
	КонецЕсли;

	Записи = Новый Массив;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Запись = Новый Структура;
		Запись.Вставить("scope", Выборка.Канал);
		Запись.Вставить("token", Выборка.Токен);
		Запись.Вставить("value", Выборка.РеальноеЗначение);
		Запись.Вставить("dataKind", Выборка.Категория);
		Запись.Вставить("createdAt", Формат(Выборка.ДатаСоздания, "ДФ=yyyy-MM-ddTHH:mm:ss"));
		Записи.Добавить(Запись);
	КонецЦикла;

	Данные = Новый Структура;
	Данные.Вставить("count", Записи.Количество());
	Данные.Вставить("records", Записи);

	Ответ = Новый Структура;
	Ответ.Вставить("success", Истина);
	Ответ.Вставить("data", Данные);
	Возврат Ответ;

КонецФункции

Функция УправлениеПолитикой(Параметры)

	Действие = НРег(СокрЛП(Параметры.action));

	Если Действие = "enable" ИЛИ Действие = "disable" Тогда

		Менеджер = РегистрыСведений.AI_AnonymizationPolicy.СоздатьМенеджерЗаписи();
		Менеджер.ОбъектМетаданных = ИмяМастерЗаписиОбъект();
		Менеджер.Реквизит = ИмяМастерЗаписиРеквизит();
		Менеджер.Включено = (Действие = "enable");
		Менеджер.Записать();

		Ответ = Новый Структура;
		Ответ.Вставить("success", Истина);
		Ответ.Вставить("policyEnabled", Действие = "enable");
		Возврат Ответ;

	ИначеЕсли Действие = "list" Тогда

		Запрос = Новый Запрос(
			"ВЫБРАТЬ ОбъектМетаданных, Реквизит, Включено, ВидДанных, Режим
			|ИЗ РегистрСведений.AI_AnonymizationPolicy
			|УПОРЯДОЧИТЬ ПО ОбъектМетаданных, Реквизит");

		Правила = Новый Массив;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Правило = Новый Структура;
			Правило.Вставить("metadataObject", Выборка.ОбъектМетаданных);
			Правило.Вставить("fieldPattern", Выборка.Реквизит);
			Правило.Вставить("enabled", Выборка.Включено);
			Правило.Вставить("dataKind", Выборка.ВидДанных);
			Правило.Вставить("mode", Выборка.Режим);
			Правила.Добавить(Правило);
		КонецЦикла;

		Данные = Новый Структура;
		Данные.Вставить("policyEnabled", ПолитикаАнонимизацииАктивна());
		Данные.Вставить("rules", Правила);

		Ответ = Новый Структура;
		Ответ.Вставить("success", Истина);
		Ответ.Вставить("data", Данные);
		Возврат Ответ;

	ИначеЕсли Действие = "add" Тогда

		Паттерн = "";
		Если Параметры.Свойство("fieldPattern") Тогда
			Паттерн = СокрЛП(Параметры.fieldPattern);
		КонецЕсли;
		Если ПустаяСтрока(Паттерн) Тогда
			Ответ = Новый Структура;
			Ответ.Вставить("success", Ложь);
			Ответ.Вставить("error", "Для action=add нужен параметр fieldPattern");
			Возврат Ответ;
		КонецЕсли;

		ОбъектМетаданных = "*";
		Если Параметры.Свойство("metadataObject") И ЗначениеЗаполнено(Параметры.metadataObject) Тогда
			ОбъектМетаданных = СокрЛП(Параметры.metadataObject);
		КонецЕсли;

		ВидДанных = "";
		Если Параметры.Свойство("dataKind") Тогда
			ВидДанных = СокрЛП(Параметры.dataKind);
		КонецЕсли;

		Режим = "Токен";
		Если Параметры.Свойство("mode") И ЗначениеЗаполнено(Параметры.mode) Тогда
			Режим = СокрЛП(Параметры.mode);
		КонецЕсли;

		Менеджер = РегистрыСведений.AI_AnonymizationPolicy.СоздатьМенеджерЗаписи();
		Менеджер.ОбъектМетаданных = ОбъектМетаданных;
		Менеджер.Реквизит = Паттерн;
		Менеджер.Включено = Истина;
		Менеджер.ВидДанных = ВидДанных;
		Менеджер.Режим = Режим;
		Менеджер.Записать();

		Ответ = Новый Структура;
		Ответ.Вставить("success", Истина);
		Ответ.Вставить("message", "Правило добавлено: " + ОбъектМетаданных + " / " + Паттерн);
		Возврат Ответ;

	ИначеЕсли Действие = "remove" Тогда

		Паттерн = "";
		Если Параметры.Свойство("fieldPattern") Тогда
			Паттерн = СокрЛП(Параметры.fieldPattern);
		КонецЕсли;
		Если ПустаяСтрока(Паттерн) Тогда
			Ответ = Новый Структура;
			Ответ.Вставить("success", Ложь);
			Ответ.Вставить("error", "Для action=remove нужен параметр fieldPattern");
			Возврат Ответ;
		КонецЕсли;

		ОбъектМетаданных = "*";
		Если Параметры.Свойство("metadataObject") И ЗначениеЗаполнено(Параметры.metadataObject) Тогда
			ОбъектМетаданных = СокрЛП(Параметры.metadataObject);
		КонецЕсли;

		Набор = РегистрыСведений.AI_AnonymizationPolicy.СоздатьНаборЗаписей();
		Набор.Отбор.ОбъектМетаданных.Установить(ОбъектМетаданных);
		Набор.Отбор.Реквизит.Установить(Паттерн);
		Набор.Записать();

		Ответ = Новый Структура;
		Ответ.Вставить("success", Истина);
		Ответ.Вставить("message", "Правило удалено: " + ОбъектМетаданных + " / " + Паттерн);
		Возврат Ответ;

	КонецЕсли;

	Ответ = Новый Структура;
	Ответ.Вставить("success", Ложь);
	Ответ.Вставить("error", "Неизвестное действие: " + Параметры.action
		+ ". Допустимо: enable, disable, add, remove, list");
	Возврат Ответ;

КонецФункции

#КонецОбласти
